DataProcessors/ПередачаГотовойПродукцииНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПередачаГотовойПродукцииНаСклад</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КанбанПереходКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанПереходКарточки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВКолонке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаДорожка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаКолонка</Name>
					<Comment>"1"  выполнена. "100"  корзина "200" приостановлена.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДКарточка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКарточки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Comment>ПустаяСтрока по умолчанию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСогласований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПередачаГотовойПродукцииНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаГотовойПродукцииНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ГотоваяПродукция</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияГотовойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПартииГотовойПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПартияГотовойПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииГотовойПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ПартииГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПартииГотовойПродукции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичноПередан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПередачаГотовойПродукцииНаСклад/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ЧастичноПередан;

&НаКлиенте
Процедура КомплектыДляПередачиПриАктивизацииСтроки(Элемент)
	ТД = Элементы.КомплектыДляПередачи.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		ВыбранныйКомплект 							= ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");
		ЧастичноПередан 							= Ложь;
		Элементы.ГруппаКнопкиПереноса.Доступность 	= Ложь;
	Иначе
	   	ВыбранныйКомплект 							= ТД.Комплекты;
		ЧастичноПередан 							= ТД.ЧастичноПередан;
		Элементы.ГруппаКнопкиПереноса.Доступность 	= Истина;
	КонецЕсли;
	
	Элементы.ИнформацияОПередаче.Доступность = ЧастичноПередан;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыДляПередачиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыДляПередачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОПередачи(Команда)
	Элементы.ГруппаИнформацияОПередаче.Видимость = Истина; 
	ТД = Элементы.КомплектыДляПередачи.ТекущиеДанные;
	ПолучитьДанныеОПередаче(ТД.Комплекты);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОПередаче(Комплект)

	

КонецФункции // ПолучитьДанныеОПередаче()


&НаКлиенте
Процедура ЗаполнитьКомплекты(Команда)
	КомплектыДляПередачи.Очистить();
	ЗаполнитьКомплектыНаСервере();
КонецПроцедуры 

Процедура ЗаполнитьКомплектыНаСервере()

	ОбъектОтчета 			= Отчеты.ОбщиеНастройки.Создать();
	ИмяДоскиПроизводства 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
    УИДКудаКолонка			= омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(ИмяДоскиПроизводства, ОбъектОтчета.НаименованиеКолонкиДляПроизводствоВМонтаж());
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.Ресурс.Ссылка КАК Комплекты,
		|	ВЫБОР
		|		КОГДА СУММА(ВЫБОР
		|					КОГДА ЕСТЬNULL(ПартииГотовойПродукции.ЧастичноПередан, ИСТИНА)
		|						ТОГДА 0
		|					ИНАЧЕ 1
		|				КОНЕЦ) = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЧастичноПередан
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииГотовойПродукции КАК ПартииГотовойПродукции
		|			ПО КанбанКарточки.Ресурс = ПартииГотовойПродукции.ИзделиеКомплект
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|ГДЕ
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = &УИДКудаКолонка
		|
		|СГРУППИРОВАТЬ ПО
		|	КанбанКарточки.Ресурс.Ссылка";
	
	Запрос.УстановитьПараметр("УИДКудаКолонка", УИДКудаКолонка);
	
	КомплектыДляПередачи.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыДляПередачиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТД = Элементы.КомплектыДляПередачи.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
    	Возврат;
	КонецЕсли; 
	
	ПоказатьЗначение(, ТД.Комплекты); 	

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаИнформацияОПередаче.Видимость = Ложь;
	ЧастичноПередан = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьИнформации(Команда)
	Элементы.ГруппаИнформацияОПередаче.Видимость = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура КомплектыВДокументПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиКомплект(Команда)
	
	УжеПеренесен = Ложь;
	
	Для каждого х Из КомплектыВДокумент Цикл
	
		Если х.Комплекты = ВыбранныйКомплект И НЕ х.ЧастичноПередан Тогда
			УжеПеренесен = Истина;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если НЕ УжеПеренесен Тогда
		
		НС = КомплектыВДокумент.Добавить();
		НС.Комплекты = ВыбранныйКомплект;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиЧастьКомплекта(Команда)
	НС = КомплектыВДокумент.Добавить();
	НС.Комплекты 		= ВыбранныйКомплект;
	НС.ЧастичноПередан 	= Истина;
КонецПроцедуры


&НаСервере
Процедура СоздатьДокументПередачиНаСкладНаСервере()
	
	СтатусНаСкладе = омНастройкаПовтор.ПолучитьСтадиюНаСкладе();
	
	МассивПартий = СоздатьПартииТовара();
	
	ДокументПередачи = Документы.ПередачаГотовойПродукцииНаСклад.СоздатьДокумент();
	ДокументПередачи.Дата = ТекущаяДата();
	ДокументПередачи.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокументПередачи.МестоХранения = МестоХранения;
	
	Для каждого х Из МассивПартий Цикл
		
		НС = ДокументПередачи.ПартииГотовойПродукции.Добавить();
		НС.ПартияГотовойПродукции = х.СправочникПартия;
		
	КонецЦикла;
	
	стПараметры = Новый Структура("Комплект, ТекущаяСтадия", , СтатусНаСкладе);
	
	ДокументПередачи.Записать(РежимЗаписиДокумента.Проведение);
	
	Комментарий = Строка(ДокументПередачи.Ссылка);
	УИДДоски 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	Для каждого х Из МассивПартий Цикл
		
		Если х.ЧастичноПередан Тогда
			Продолжить;
		КонецЕсли;
		
		омКанбанДоскиНаСервере.ПеревестиКарточкуВВыполнено(УИДДоски, х.ИзделиеКомплект, Комментарий);
		
		стПараметры.Комплект = х.ИзделиеКомплект;
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
		
	КонецЦикла;

КонецПроцедуры

Функция СоздатьПартииТовара()

	МассивПартий = Новый Массив;
	
	Для каждого ТекущийКомплект Из КомплектыВДокумент Цикл
	
		СправочникПартия = Справочники.ПартииГотовойПродукции.СоздатьЭлемент();
		СправочникПартия.Наименование 		= ТекущийКомплект.Комплекты;
		СправочникПартия.ИзделиеКомплект 	= ТекущийКомплект.Комплекты;
		СправочникПартия.Комментарий 		= ТекущийКомплект.Комментарий;
		СправочникПартия.ЧастичноПередан	= ТекущийКомплект.ЧастичноПередан;
		
		СправочникПартия.Записать();
		
		МассивПартий.Добавить(Новый Структура("СправочникПартия, ИзделиеКомплект, ЧастичноПередан"
												, СправочникПартия.Ссылка
												, ТекущийКомплект.Комплекты
												, ТекущийКомплект.ЧастичноПередан));
	
	КонецЦикла;
	
	Возврат МассивПартий;

КонецФункции // СоздатьПартииТовара()



&НаКлиенте
Процедура СоздатьДокументПередачиНаСклад(Команда)
	
	Если ЗначениеЗаполнено(МестоХранения) Тогда
	
		СоздатьДокументПередачиНаСкладНаСервере(); 
		
		Закрыть();
	
	КонецЕсли;
	
КонецПроцедуры
